#include <stdio.h>
#include <math.h>
#include <locale.h>
void main()
{
	float h, w, d, t_1, t_2, t_3, w_1, m_1, m_2, m_3, m_4, m_5, d_1, p_dsp, p_dvp, p_dereva;
	int k;
	t_1 = 0.5;//толщина задней ДВП.
	t_2 = 1.5;//толщина ДСП.
	t_3 = 1.0;//толщина дерева.
	setlocale(LC_ALL, "Rus");
	printf("Введите плотность ДСП, потом плотность ДВП, Затем плотность Дерева (в кг/м^3).\n");
	scanf("%f%f%f", &p_dsp, &p_dvp, &p_dereva);
	printf("Введите высоту, ширинуб, глубину.\n");
	scanf("%f%f%f", &h, &w, &d);
	if ((h < 180) || (h > 220) || (w < 80) || (w > 120) || (d<50) || (d>90))
	{
		printf("Высота должна быть от 180 до 220, ширина от 80 до 120, глубина от 50 до 90.\n");
		return;
	}
	w_1 = w - t_2;//ширина полок равна ширене верхней и нижней крышек минус толщина боковин.
	d_1 = d - t_1;//глубина полок равна глубине боковин минус ширена задней стенки.
	if (h > 200)//полки у нас через каждые 40см, а не расстояние между полками 40см, поэтому я решил не использовать толщину полки.
	{
		k = 5;
	}
	else
	{
		k = 4;
	}
	m_1 = ((h*w*t_1) / 1000000)*p_dvp;//масса задней стенки
	m_2 = ((h*d*t_2) / (1000000))*p_dsp * 2;//масса двух боковин
	m_3 = ((d*w*t_2) / 1000000)*p_dsp * 2;//масса двух крышек
	m_4 = ((h*w*t_3) / 1000000)*p_dereva;//масса дверей
	m_5 = ((w_1*t_2*d_1) / 1000000)*p_dsp*k;//масса полок
	printf("масса шкафа %f кг", m_1 + m_2 + m_3 + m_4 + m_5);
	"/n";
}