#include <stdio.h>
#include <math.h>
#include <locale.h>
void main()
{
	setlocale(LC_ALL, "Rus");
	float h, w, d, t_1, t_2, t_3,w_1;
	int k;
	t_1 = 0.05;//толщина задней ДВП.
	t_2 = 0.15;//толщина ДСП.
	t_3 = 1.0;//толщина дерева.
	printf("Введите высоту, ширинуб, глубину.");
	scanf("%f%f%f", &h, &w, &d);
	if ((h < 180) || (h > 220) || (w < 80) || (w > 120) || (d<50) || (d>90) )
	{
		printf("Высота должна быть от 180 до 220, ширина от 80 до 120, глубина от 50 до 90.");
		return;
	}
	w_1 = w - t_2;//ширина полок равна ширене верхней и нижней крышек минус толщина боковин.
	if (h > 200)//полки у нас через каждые 40см, а не расстояние между полками 40см, поэтому я решил не использовать толщину полки.
	{
		k = 5;
	}
	else
	{
		k = 4;
	}
	float p_dsp = 725.0, p_dvp = 925.0, p_dereva = 535.0;//плотность в кг/м^3
	float m_1, m_2, m_3, m_4, m_5;
	m_1 = ((h*w*t_1) / 1000000)*p_dvp;//масса задней стенки
	m_2 = ((h*d*t_2) / (1000000))*p_dsp*2;//масса двуз боковин
	m_3 = ((d*w*t_2) / 1000000)*p_dsp * 2;//масса двух крышек
	m_4 = ((h*w*t_3) / 1000000)*p_dereva;//масса дверей
	m_5 = ((w_1*t_2*d) / 1000000)*p_dsp*k;//масса полок
	printf("масса шкафа %f кг", m_1 + m_2 + m_3 + m_4 + m_5); 
	"/n";

}