#include <stdio.h>
#include <math.h>
#include <locale.h>

int main(){
    int r1, r2, x1, x2, y1, y2, s;
    printf("Добро пожаловать в программу по анализу двух окружностей. Врятле она кому нибудь когда нибудь будет полезна, но спасибо, что хоть запустили ее.\nX1=");
    scanf("%d", &x1);
    printf("Y1=");
    scanf("%d", &y1);
    printf("R1=");
    scanf("%d", &r1);
    printf("X2=");
    scanf("%d", &x2);
    printf("Y2=");
    scanf("%d", &y2);
    printf("R2=");
    scanf("%d", &r2);


    //Вычисление расстояния между центрами окружностей
    s=sqrt(((x1-x2)*(x1-x2))+((y1-y2)*(y1-y2)));

    //Блок IF с равными радиусами окружностей
    if(r1==r2){
        if((x1==x2)&&(y1==y2)){
            printf("Окружности полностью совпадают");
        }else if(s<(r1+r2)){
            printf("Окружности равных радиусов имеют две общие точки");
        }else if(s==(r1+r2)){
            printf("Окружности равных радиусов имеют одну общую точку");
        }else{
            printf("Окружности равных радиусов НЕ имеют общих точек");
        }
    } 
    
    //Блок IF с разными радиусами
    else{
        if((x1==x2)&&(y1==y2)){
            if(r1>r2){
                printf("Вторая окружность находится внутри первой, причем их центры совпадают");
            }else{
                printf("Первая окружность находится внутри второй, причем их центры совпадают");
            }
        }else{
    //Если их центры не совпадают
            if((s==(r1-r2))||(s==(r2-r1))||(s==(r1+r2))){
    //Если окружности имеют лишь одну общую точку            
                if((s=(r1-r2))||((s=(r1+r2))&&(r1>r2))){
                    printf("Окружности имеют лишь одну общую точку, причем вторая окружность меньше первой, а их центры не совпадают");
                }else if(s==(r2-r1)||((s==(r1+r2))&&(r1<r2))){
                    printf("Окружности имеют лишь одну общую точку, причем первая окружность меньше второй, и их центры не совпадают");
                }
            }else if(s<(r1+r2)){
    //Если окружности имеют две общие точки  
                if(((r1>r2)||(r1<r2))&&((r2<(r1-s))||(r1<(r2-s)))&&((s<r1)||s<r2)){
                    if(r1>r2){
                        printf("Вторая окружность находится внутри первой");
                    }else{
                        printf("Первая окружность находится внутри второй");
                    }
                }else if(r1>r2){
                    printf("Окружности имеют две общие точки, причем вторая окружность меньше первой, а их центры не совпадают");
                }else{
                    printf("Окружности имеют две общие точки, причем первая окружность меньше второй, а их центры не совпадают");
                }
            }else{
                if(r1>r2){
                    printf("Окружности не имеют общих точек и не находятся внутри друг друга, причем вторая окружность меньше первой");
                }else{
                    printf("Окружности не имеют общих точек и не находятся внутри друг друга, причем первая окружность меньше второй");
                }
                }
            }
        }
        
    getchar();
    return 0;
    }












