# include <stdio.h> //подключение библиотек
# include <locale.h>
# include <math.h>

int main() {
	setlocale(LC_ALL, "Rus"); //локализация текста при выводе
	float x1, y1, R1, x2, y2, R2; // x,y координаты соответствующих окружностей, а R радиусы

	printf("Введите координаты центра 1ой окружности и её радииус\n");//задание параметров окружности 1
	printf("x1 y1 R1 = ");
	scanf("%f %f %f", &x1, &y1, &R1);
	if (R1 <= 0) {
		printf("Т.к радиус 1ой окружности <=0 это не окружность");// проверка на окружность
		return 0;
	}
	printf("Введите координаты центра 2ой окружности и её радииус\n");//задание параметров окружности 2
	printf("x2 y2 R2 = ");
	scanf("%f %f %f", &x2, &y2, &R2);
	if (R2 <= 0) {
		printf("Т.к радиус 2ой окружности <= 0 это не окружность"); // проверка на окружность
		return 0;
	}

	if ((x1 == x2) && (y1 == y2)) { // условия при одинаковых координатах центра окружности
		if (R1 > R2) 
			printf("Окружность 2 находится внутри окружности 1 с центрами в одной точке");
		if (R1 < R2) 
			printf("Окружность 1 находится внутри окружности 2 с центрами в одной точке");
		if (R1==R2)
			printf("Окружности совпадают");
	} 

	if (((sqrt((abs(x1 - x2)) * (abs(x1 - x2)) + (abs(y1 - y2)) * (abs(y1 - y2))))) > R1 + R2) 
		printf("Окружности не имеют общих точек");
	if (((sqrt((abs(x1 - x2)) * (abs(x1 - x2)) + (abs(y1 - y2)) * (abs(y1 - y2))))) == R1 + R2)
		printf("Окружности касаются");
	if (((sqrt((abs(x1 - x2)) * (abs(x1 - x2)) + (abs(y1 - y2)) * (abs(y1 - y2))))) < R1 + R2)
		printf("Окружности пересекаются");
		
	return 0;
}