/*
Данные для проверки:
Cовпадают: 
0 0 0 0
6 6
Не пересекаются и не касаются:
0 0 -5 3
2 2
Окружности касаются внешне:
0 0 0 -6
3 3
Окружности пересекаются:
-2 -2 1 1
3 2
Окружности касаются, одна окружность внутри другой:
0 0 3 0
5 2
Одна окружность внутри другой, центры не совпадают, окружности не касаются:
0 0 1 0
5 3
Окружности не пересекаются, центры совпадают
1 1 1 1
6 2
*/
#include <stdio.h>
#include <math.h>
#include <locale.h>
int main()
{
  float cx1, cy1, r1, cx2, cy2, r2, d;
  setlocale(LC_ALL, "Russian");
  printf("Введите координаты центров окружностей(x1, y1, x2, y2): ");
  scanf_s("%f %f %f %f", &cx1, &cy1, &cx2, &cy2);
  printf("Введите радиусы окружностей(r1, r2): ");
  scanf_s("%f %f", &r1, &r2);
  d = sqrt((cx1 - cx2) * (cx1 - cx2) + (cy1 - cy2) * (cy1 - cy2));
  if (r1 <= 0 || r2 <= 0)
  {
    printf("Не существует");
    return 1;
  }
  if (cx1 == cx2 && cy1 == cy2 )
  {
    if (r1 == r2)
    {
      printf("Окружности совпадают");
    }
    else
    {
      printf("Центры окружностей совпадают; Одна окружность внутри другой");
    }
  }
  else if(d>(r1+r2))
  {
    printf("Окружности не касаются и не пересекаются");
  }
  else if (d == (r1 + r2))
  {
      printf("Окружности касаются");
  }
  else if (d < (r1 + r2) && d > abs((r1-r2)))
  {
      printf("Окружности пересекаются");
  }
  else if (d == abs((r1 - r2)))
  {
      printf("Окружности касаются, при этом одна окружность внутри другой");
  }
  else
  {
      printf("Окружности не касаются, при этом одна окружность внутри другой, центры не совпадают");
  }
 return 0;
}

