#include <stdio.h>

int main() {
    float x1, y1, r1, x2, y2, r2, s;
    printf("введите координаты центра и радиус первой окружности\n");
    scanf_s("%f %f %f", &x1, &y1, &r1);
    printf("введите координаты центра и радиус второй окружности\n");
    scanf_s("%f %f %f", &x2, &y2, &r2);

    if ((r1 < 0) || (r2 < 0)) {
        printf("отрицательные радиусы");
        return 1;
    }

    // расстояние между центрами окружностей
    s = sqrt((x2 - x1) * (x2 - x1) + (y2 - y1) * (y2 - y1));

        if ((x1 == x2) && (y1 == y2) && (r1 == r2)) {
            printf("окружности совпадают");
            return 0;
        }

    if (s > r1 + r2) {
        printf("окружности не пересекаются и не лежат друг в друге");
        return 0;
    }

    if ((s < r2 - r1) || (s < r1 - r2)) {
        printf("одна окружность лежит внутри другой");
        return 0;
    }

    if (s == r1 + r2) {
        printf("окружности касаются внешним образом");
        return 0;
    }

    if ((s == r2 - r1) || (s == r1 - r2)) {
        printf("окружности касаются внутренним образом");
        return 0;
    }

    printf("окружности пересекаются");
    return 0;

}

