#include <stdio.h>

/*
Задача
Фирма выпускает двудверные шкафы для одежды
Состав шкафа:
1) накладная стенка из двп высотой h  180-220 см
шириной w от 80-120см и толщиной 5мм
2) 2 боковины из дсп высотой h глубиной d 50-90см толщиной 15мм
3) накладные верхние и нижние крышки из дсп
шириной w глубиной d и толщиной 15мм
4) 2 накладные двери из дерева высотой h, шириной w , толщиной 1см
5) внутренние полки в шкафу через каждые 40 см из дсп

Считая,что известны плотности двп дсп и дерева
найти массу шкафа

Плотности:
двп  950 кг/м^2
дсп 750 кг/м^2
дерево 720 кг/м^2 (дерево == бук)
*/


/*
Testcases
Test1:
input : 180 80 50
output: 55.7kg

Test2:
input : 220 120 90
output:

*/



int main() {
    int dvp = 950;
    int dsp = 650; // массы материалов
    int wood = 660;
    int k_polok = 0; // кол-во полок
    double v1, m1; // объём 1 и масса 1
    double v2, m2; // объём 2 и масса 2
    double v3, m3; // объём 3 и масса 3   
    double v4, m4; // объём 4 и масса 4
    double v5, m5; // объём 5 и масса 5
    int wrong = 0;
    double h, w, d;
    printf("Type height , width and depth in centimeters \n");
    printf("  180 <= height <= 220\n");
    printf("   80 <=  width <= 120\n");
    printf("   50 <=  depth <=  90\n");
    do {
        wrong = 0;
        scanf("%lf %lf %lf", &h, &w, &d);
    //если          хоть какой-то ввод неверный
        if (h > 220 || h < 180 || w > 120 || w < 80 || d >90 || d < 50) {
            printf("Wrong input!\n Check sizes of every parameter!\n");
            wrong = 1;
        }
    } while (wrong);
    
    h = h / 100; 
    w = w / 100;  // перевод величин в метры
    d = d / 100;
    
    // 1) накладная стенка из ДВП 
    // высотой h     шириной w    толщиной 0.005м    
    v1 = w * h * 0.005; 
    m1 = dvp*v1; // плотность * объём


    // 2) 2 боковины из ДСП 
    // высотой h      глубиной d     толщиной 15мм == 0.015 м
    v2 = 2*(h * d * 0.015); // объём ДВУХ боковин
    m2 = dsp*v2;
     // вычитаю толщину боковин
                    // получая при этом ширину будущих полок
                    

    // 3) НАКЛАДНЫЕ верхние и нижние крышки  из ДСП
    // шириной  w      глубиной  d   толщиной 0.015м    
    v3 = 2 * (w*d*0.015); // объём двух крышек
    m3 = dsp * v3;


    // 4) 2 НАКЛАДНЫЕ двери из ДЕРЕВА  
    // высотой h      шириной w      толщиной  1см==0.01м
    v4 = 2 * (h*w/2*0.01); // w/2 == ширине 1 двери
    m4 = wood * v4;


    w -= (0.015 * 2); // вычитаю толщину боковых стенок
                      // чтобы получить ширину полок

    // 5) внутренние полки в шкафу из ДСП
    // находятся на расстоянии >=40 см друг от друга и от краёв
    // глубиной  d    шириной  w   толщиной 0.015м    
    v5 = d * w * 0.015; // объём ОДНОЙ полки
    m5 = dsp*v5;      // масса ОДНОЙ полки
    
    while ((h - (k_polok * 0.415))>0.4) {
        k_polok++;
    }
    
    
    m5 *= k_polok; // масса ВСЕХ полок
    
    printf("Wardrobe weights %lf",m1+m2+m3+m4+m5);
    return 0;
}