#include <stdio.h>
void main ()
{
 float r1, r2, R;
//R- рассто€ние между центрами окружностей
 scanf("%f %f %f", &r1, &r2 , &R);
 if (r1==r2)
	{
	printf("ќкружности совпадают");
	return;
	}
 if (R > r1+r2)
   {
	printf("ќкружности не пересекаютс€");
	return;
   }
 if (((R < r1 - r2)&&(r1 > r2))||((R < r2 - r1)&&(r2 > r1)))
   {
	printf("ќдна окружность лежит внутри другой, но они не пересекаютс€");
	return;
   }
 if	(((R == r1 - r2)&&(r1 > r2))||((R == r2 - r1)&&(r2 > r1)))
   {
	 printf("ќдна окружность лежит внутри другой и они касающиес€");
	 return;
   }
 if (((r1 > r2)&&((R > r1 - r2)&&(R < r1+ r2)))||((r2 > r1)&&((R > r2 - r1)&&(R < r1+ r2))))
   {
	 printf("ќкружности пересекаютс€ в двух точках");
	 return;
   }
 if (R = r1 + r2)
   {
    printf("ќкружности пересекаютс€ в одной точке, но не лежат одна в другой ");
    return;
   }			
}