#include <stdio.h>
#include <locale.h>
#define p_dvp 735 //плотность ДВП
#define p_dcp 800 //плотность ДСП
#define p_tree 700 //плотность дерева(дуб)
/*Тесты: 
Средние значения
Задняя стенка: 200 100 5
Боковины: 70 15
Крышки: 15
Двери: 1
Ответ: 86,0

Максимальные значения
Задняя стенка: 220 120 5
Боковины: 90 15
Крышки: 15
Двери: 1
Ответ: 120,55

Минимальные значения
Задняя стенка: 180 80 5
Боковины: 50 15
Крышки: 15
Двери: 1
Ответ: 56,77 */

int main() {
	float h1, w1, d1, V1; // накладная задняя стенка из ДВП
	setlocale(LC_ALL, "");
	printf("Введите высоту (см), ширину (см) и толщину (мм) задней стенки: ");
	scanf_s("%f %f %f", &h1, &w1, &d1);
	if  ((h1 >= 180 && h1 <= 220) && (w1 >= 80 && w1 <= 120) && (d1 == 5)) {
		V1 = (((h1 / 100) * (w1 / 100)) * (d1 / 1000)); // накладная задняя стенка из ДВП - объем
	}
	else {
		printf("Неправильные параметры задней стенки\n");
		return 1;
	}
	
	float w2, d2, V2; // 2 боковины из ДСП
	printf("Введите ширину (см) и толщину (мм) боковин: ");
	scanf_s("%f %f", &w2, &d2);
	if ((w2 >= 50 && w2 <= 90) && (d2 == 15)) {
		V2 = ((h1 / 100) * (w2 / 100)) * (d2 / 1000); // 2 боковины из ДСП - объем
	}
	else {
		printf("Неправильные параметры боковин\n");
		return 1;
	}

	float d3, V3; // накладные верхняя и нижняя крышки из ДСП
	printf("Введите толщину (мм) крышек: ");
	scanf_s("%f", &d3);
	if (d3 == 15) {
		V3 = ((w1 / 100) * (w2 / 100)) * (d3 / 1000); // накладные верхняя и нижняя крышки из ДСП - объем
	}
	else {
		printf("Неправильные параметры крышек\n");
		return 1;
	}

	float d4, V4; // 2 накладные двери из дерева
	printf("Введите толщину (см) дверей: ");
	scanf_s("%f", &d4);
	if (d4 == 1) {
		V4 = (((h1 / 100) * (w1 / 100)) * (d4 / 100)) * 2; // 2 накладные двери из дерева - объем
	}
	else {
		printf("Неправильные параметры дверей\n");
		return 1;
	}

	float h5 = (w1 - (d2 / 10)) / 100, w5 = ((w2 * 10) - (d1 + d4)) / 1000, d5 = 15, V5, n = (h1 - 80) / 40; // n полок толщиной 15 мм
	V5 = ((h5 * w5 / 100) * (d5 / 1000)) * n; // n полок толщиной 15 мм - объем
	
	float m; // Масса шкафа
	m = (V1 * p_dvp) + ((V2 + V3) * 2) * p_dcp + (V4 * p_tree) + V5 * p_dcp;
	printf("Масса шкафа: %.2f", m);
	return 0;
}