#include <stdio.h>
#include <locale.h>
void main()
{
	float w, h, d, ds, dp, dw, m;	/* Объявляем переменные и задаём плотность материаллов*/
	int p;
	setlocale(LC_ALL, "Rus");
	printf("Введите плотность ДСП, ДВП и дерева через пробел в кг/м^3 /n");
	scanf("%f %f %f", &ds, &dp, &dw);
	printf("Введите высоту, ширину и глубину шкафа через пробел в см. /n");	/*Ввод данных*/
	scanf("%f %f %f", &h, &w, &d);
	if ((w<80) || (w>120) || (h<180) || (h>220) || (d<50) || (d>90))	/*Защита от дурака*/
	{
		printf("Ошибка");
		return;
	}
	p = (int)h / 40;	/*Расчёты*/
	w = w / 100;
	h = h / 100;
	d = d / 100;
	m = (h - 2 * 0.015) / (0.4 + 0.015) * (w - 2 * 0.015) * (d - 0.005) * ds;
	m = m + ((h - 2 * 0.015) * (d - 0.005) * ds * 0.015 * 2);
	m = m + (w*h*0.005*ds);
	m = m + (w*h*0.01*dw);
	m = m + (w*(d - 0.005) * 2 * ds * 0.0015);
	printf("%f масса шкафа в кг", m);	/*Вывод данных*/
	return;
}