#include <stdio.h>
#include<math.h>
#include <locale.h>
int main() {
	setlocale(LC_ALL, "Russian");
	float r1, r2, x1, x2, y2, y1, d1, d2;
	printf("Введите радиус и координаты центра первой окружности:\n");
	scanf_s("%f %f %f", &r1, &x1, &y1);
	printf("Введите радиус и координаты центра второй окружности:\n");
	scanf_s("%f %f %f", &r2, &x2, &y2);
	d1 = sqrt(pow(x2 - x1, 2) + pow(y2 - y1, 2));
	if (d1 > (r1 + r2))
		printf("Окружности не пересекаются. Одна окружность лежит вне другой\n");
	else if (d1 == (r1 + r2))
		printf("Окружности внешне касающиеся\n");
	else if (d1 < (r1 - r2))
		printf("Одна окружность находится внутри другой, но они не пересекаются\n");
	else if ((x1 == x2) && (y1 == y2) && (r1 != r2))
		printf("Окружности концентрические\n");
	else if ((r1 == r2) && (d1 == 0))
		printf("Окружности совпадают\n");
	else if ((d1 == 0) && (r1 != r2))
		printf("Окружности не пересекаются, но одна окружность лежит внутри другой.Окружности образуют кольцо\n");
	else if (d1 == fabs(r1 - r2))
		printf("Окружности внутренне касающиеся\n");
	else
		printf("Окружности пересекающиеся. Окружности касаются в двух точках\n");

	return 0;
}